app/Controllers/GuestbookController.php

SELECT *
FROM `guestbook`
---
    public function index()
    {
        $model = new GuestbookModel();
        // Grabbing all data from the database
        $data['entries'] = $model->findAll();

INSERT INTO `guestbook` (`username`, `comment`, `created_at`) VALUES ('Attacker ', 'Hi', '2026-05-27 09:01:02')
---
    public function create()
    {
        $model = new GuestbookModel();

        // Server-side validation check
        if ($this->request->is('post')) {
            $rules = [
                'username' => 'required|max_length[100]',
                'comment'  => 'required',
            ];

            if ($this->validate($rules)) {
                $model->save([
                    'username' => $this->request->getPost('username'),
                    'comment'  => $this->request->getPost('comment'),
                ]);